# Set Method (ElementId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..Set Method (ElementId)
Parameter Class See Also
---
Sets the parameter to a new element id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Set(
	ElementId value
)
```

Visual Basic
---
```text
Public Function Set ( _
	value As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool Set(
	ElementId^ value
)
```

# ### Parameters
value
    Type: Autodesk.Revit.DB..::..ElementIdThe new element id to which the parameter is to be set.
# ### Return Value
The Set method will return True if the parameter was successfully set to the new value, otherwise false.
# Remarks
You should only use this method if the StorageType property reports the type of the parameter as an ElementId.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The parameter is read-only. |

# See Also
Parameter Class
Set Overload
Autodesk.Revit.DB Namespace